from django.db import models
from django.contrib.auth.models import User
from django.core.validators import FileExtensionValidator
from django.db.models.signals import post_save
from django.dispatch import receiver

from django.db import models
from django.contrib.auth.models import User
from django.core.validators import FileExtensionValidator


class Document(models.Model):

    TYPE_CHOICES = [
        ('internal', 'ภายใน'),
        ('external', 'ภายนอก')
    ]

    SECRET_CHOICES = [
        ('normal', 'ปกติ'),
        ('secret', 'ลับ'),
        ('verysecret', 'ลับมาก'),
        ('topsecret', 'ลับที่สุด')
    ]

    URGENCY_CHOICES = [
        ('normal', 'ปกติ'),
        ('urgent', 'ด่วน'),
        ('veryurgent', 'ด่วนมาก'),
        ('topurgent', 'ด่วนที่สุด')
    ]

    STATUS_CHOICES = [
        ('draft', 'ร่าง'),
        ('waiting', 'รอผอ.พิจารณา'),
        ('signed', 'ผอ.ลงนามแล้ว'),
        ('forwarded', 'ส่งต่อแผนกแล้ว'),
    ]

    DEPARTMENT_CHOICES = [
        # ฝ่ายบริหาร
        ('งานการเงินและงบประมาณ', 'งานการเงินและงบประมาณ'),
        ('งานซ่อมบำรุงทั่วไป', 'งานซ่อมบำรุงทั่วไป'),
        ('งานวิศวกรรมทางการแพทย์', 'งานวิศวกรรมทางการแพทย์'),
        ('กลุ่มงานทรัพยากรบุคคล', 'กลุ่มงานทรัพยากรบุคคล'),
        ('งานนิติการ', 'งานนิติการ'),
        ('กลุ่มงานบริหารทั่วไป', 'กลุ่มงานบริหารทั่วไป'),
        ('งานยานพาหนะ', 'งานยานพาหนะ'),
        ('งานเคหะบริการและอาคารสถานที่', 'งานเคหะบริการและอาคารสถานที่'),
        ('งานสิ่งแวดล้อมและความปลอดภัย', 'งานสิ่งแวดล้อมและความปลอดภัย'),
        ('งานการจัดการของเสีย', 'งานการจัดการของเสีย'),
        ('งานบัญชี', 'งานบัญชี'),
        ('งานประชาสัมพันธ์', 'งานประชาสัมพันธ์'),
        ('กลุ่มงานพัสดุ', 'กลุ่มงานพัสดุ'),
        ('งานพัสดุการแพทย์', 'งานพัสดุการแพทย์'),
        ('งานสอบราคาประกวดราคา', 'งานสอบราคาประกวดราคา'),
        ('โรงพยาบาลนครปฐม', 'โรงพยาบาลนครปฐม'),
        ('สำนักผู้บริหาร', 'สำนักผู้บริหาร'),
        # กลุ่มการพยาบาล
        ('กลุ่มการพยาบาล', 'กลุ่มการพยาบาล'),
        ('คลินิกมาตามนัด', 'คลินิกมาตามนัด'),
        ('งานการพยาบาลผู้ป่วยนอก', 'งานการพยาบาลผู้ป่วยนอก'),
        ('ศูนย์คัดกรอง', 'ศูนย์คัดกรอง'),
        ('ศูนย์เปล', 'ศูนย์เปล'),
        ('ศูนย์Admit-DischargeCenter', 'ศูนย์Admit-DischargeCenter'),
        ('ห้องฉีดยา', 'ห้องฉีดยา'),
        ('ห้องตรวจกุมารเวชกรรม', 'ห้องตรวจกุมารเวชกรรม'),
        ('ห้องตรวจจักษุ', 'ห้องตรวจจักษุ'),
        ('ห้องตรวจศัลยกรรม', 'ห้องตรวจศัลยกรรม'),
        ('ห้องตรวจสูติ-นรีเวชกรรม', 'ห้องตรวจสูติ-นรีเวชกรรม'),
        ('ห้องตรวจหู คอ จมูก', 'ห้องตรวจหู คอ จมูก'),
        ('ห้องตรวจออร์โธปิดิกส์', 'ห้องตรวจออร์โธปิดิกส์'),
        ('ห้องตรวจอายุรกรรม', 'ห้องตรวจอายุรกรรม'),
        ('ห้องฝากครรภ์', 'ห้องฝากครรภ์'),
        ('งานการพยาบาลผู้คลอด', 'งานการพยาบาลผู้คลอด'),
        ('งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน'),
        ('งานการพยาบาลศูนย์ส่งต่อ', 'งานการพยาบาลศูนย์ส่งต่อ'),
        ('งานการพยาบาลวิสัญญี', 'งานการพยาบาลวิสัญญี'),
        ('งานการพยาบาลห้องผ่าตัด', 'งานการพยาบาลห้องผ่าตัด'),
        ('งานซักฟอก', 'งานซักฟอก'),
        ('งานป้องกันและควบคุมการติดเชื้อ', 'งานป้องกันและควบคุมการติดเชื้อ'),
        ('งานหน่วยจ่ายกลาง', 'งานหน่วยจ่ายกลาง'),
        ('งานตรวจรักษาพิเศษทางตา', 'งานตรวจรักษาพิเศษทางตา'),
        ('งานตรวจหัวใจและหลอดเลือด', 'งานตรวจหัวใจและหลอดเลือด'),
        ('งานไตเทียม', 'งานไตเทียม'),
        ('งานห้องปฏิบัติการสวนหัวใจและหลอดเลือด', 'งานห้องปฏิบัติการสวนหัวใจและหลอดเลือด'),
        ('ศูนย์โรคหัวใจ', 'ศูนย์โรคหัวใจ'),
        ('งานห้องส่องกล้อง', 'งานห้องส่องกล้อง'),
        ('ศูนย์ประสานโรคหัวใจ', 'ศูนย์ประสานโรคหัวใจ'),
        # หอผู้ป่วย / ห้องผู้ป่วยหนัก
        ('หอผู้ป่วยมะเร็งและเคมีบำบัด', 'หอผู้ป่วยมะเร็งและเคมีบำบัด'),
        ('ห้องผู้ป่วยหนักอายุรกรรมโรคหัวใจ 2', 'ห้องผู้ป่วยหนักอายุรกรรมโรคหัวใจ 2'),
        ('ห้องผู้ป่วยหนักกุมารเวชกรรม', 'ห้องผู้ป่วยหนักกุมารเวชกรรม'),
        ('ห้องผู้ป่วยหนักทารกแรกเกิด', 'ห้องผู้ป่วยหนักทารกแรกเกิด'),
        ('ห้องผู้ป่วยหนักโรคหลอดเลือดสมอง', 'ห้องผู้ป่วยหนักโรคหลอดเลือดสมอง'),
        ('ห้องผู้ป่วยหนักศัลยกรรม 1', 'ห้องผู้ป่วยหนักศัลยกรรม 1'),
        ('ห้องผู้ป่วยหนักศัลยกรรมประสาทและสมอง', 'ห้องผู้ป่วยหนักศัลยกรรมประสาทและสมอง'),
        ('ห้องผู้ป่วยหนักศัลยกรรมหัวใจและทรวงอก', 'ห้องผู้ป่วยหนักศัลยกรรมหัวใจและทรวงอก'),
        ('ห้องผู้ป่วยหนักอายุรกรรม 1', 'ห้องผู้ป่วยหนักอายุรกรรม 1'),
        ('ห้องผู้ป่วยหนักอายุรกรรม 2', 'ห้องผู้ป่วยหนักอายุรกรรม 2'),
        ('ห้องผู้ป่วยหนักอายุรกรรม 3', 'ห้องผู้ป่วยหนักอายุรกรรม 3'),
        ('ห้องผู้ป่วยหนักอายุรกรรมโรคหัวใจ 1', 'ห้องผู้ป่วยหนักอายุรกรรมโรคหัวใจ 1'),
        ('หอผู้ป่วยกุมารเวชกรรม', 'หอผู้ป่วยกุมารเวชกรรม'),
        ('หอผู้ป่วยทารกแรกเกิด', 'หอผู้ป่วยทารกแรกเกิด'),
        ('หอผู้ป่วยพิเศษพระร่วงโรจนฤทธิ์', 'หอผู้ป่วยพิเศษพระร่วงโรจนฤทธิ์'),
        ('หอผู้ป่วยตา หู คอ จมูก', 'หอผู้ป่วยตา หู คอ จมูก'),
        ('หอผู้ป่วยพิเศษ 3-สงฆ์', 'หอผู้ป่วยพิเศษ 3-สงฆ์'),
        ('หอผู้ป่วยราชทัณฑ์ปันสุข', 'หอผู้ป่วยราชทัณฑ์ปันสุข'),
        ('หอผู้ป่วยนรีเวชกรรม', 'หอผู้ป่วยนรีเวชกรรม'),
        ('หอผู้ป่วยสูติกรรม', 'หอผู้ป่วยสูติกรรม'),
        ('หอผู้ป่วยประกันสังคมและพิเศษรวม', 'หอผู้ป่วยประกันสังคมและพิเศษรวม'),
        ('หอผู้ป่วยพิเศษ 55 ปี', 'หอผู้ป่วยพิเศษ 55 ปี'),
        ('หอผู้ป่วยออร์โธปิดิกส์ชาย', 'หอผู้ป่วยออร์โธปิดิกส์ชาย'),
        ('หอผู้ป่วยออร์โธปิดิกส์หญิง', 'หอผู้ป่วยออร์โธปิดิกส์หญิง'),
        ('หอผู้ป่วยพิเศษศัลยกรรมชั้น 6', 'หอผู้ป่วยพิเศษศัลยกรรมชั้น 6'),
        ('หอผู้ป่วยพิเศษศัลยกรรมชั้น 7', 'หอผู้ป่วยพิเศษศัลยกรรมชั้น 7'),
        ('หอผู้ป่วยพิเศษVIP', 'หอผู้ป่วยพิเศษVIP'),
        ('หอผู้ป่วยศัลยกรรม 55 ปี', 'หอผู้ป่วยศัลยกรรม 55 ปี'),
        ('หอผู้ป่วยศัลยกรรมชาย', 'หอผู้ป่วยศัลยกรรมชาย'),
        ('ห้องผู้ป่วยหนักศัลยกรรม 2', 'ห้องผู้ป่วยหนักศัลยกรรม 2'),
        ('หอผู้ป่วยศัลยกรรมหญิง', 'หอผู้ป่วยศัลยกรรมหญิง'),
        ('หอผู้ป่วยศัลยกรรมอุบัติเหตุ', 'หอผู้ป่วยศัลยกรรมอุบัติเหตุ'),
        ('หอผู้ป่วยพิเศษอายุรกรรม 1', 'หอผู้ป่วยพิเศษอายุรกรรม 1'),
        ('หอผู้ป่วยพิเศษอายุรกรรม 2', 'หอผู้ป่วยพิเศษอายุรกรรม 2'),
        ('หอผู้ป่วยโรคหลอดเลือดสมองอายุรกรรม', 'หอผู้ป่วยโรคหลอดเลือดสมองอายุรกรรม'),
        ('หอผู้ป่วยหัวใจเฉพาะทาง', 'หอผู้ป่วยหัวใจเฉพาะทาง'),
        ('หอผู้ป่วยหลวงพ่อแช่ม 3-4', 'หอผู้ป่วยหลวงพ่อแช่ม 3-4'),
        ('หอผู้ป่วยอายุรกรรมชาย 1', 'หอผู้ป่วยอายุรกรรมชาย 1'),
        ('หอผู้ป่วยอายุรกรรมชาย 2', 'หอผู้ป่วยอายุรกรรมชาย 2'),
        ('หอผู้ป่วยอายุรกรรมหญิง 1', 'หอผู้ป่วยอายุรกรรมหญิง 1'),
        ('หอผู้ป่วยอายุรกรรมหญิง 2', 'หอผู้ป่วยอายุรกรรมหญิง 2'),
        # กลุ่มงานวิชาการ / คลินิก
        ('กลุ่มงานทันตกรรม', 'กลุ่มงานทันตกรรม'),
        ('กลุ่มงานกุมารเวชกรรม', 'กลุ่มงานกุมารเวชกรรม'),
        ('กลุ่มงานจักษุวิทยา', 'กลุ่มงานจักษุวิทยา'),
        ('กลุ่มงานจิตเวชและยาเสพติด', 'กลุ่มงานจิตเวชและยาเสพติด'),
        ('กลุ่มงานเทคนิคการแพทย์และพยาธิวิทยาคลินิก', 'กลุ่มงานเทคนิคการแพทย์และพยาธิวิทยาคลินิก'),
        ('กลุ่มงานนิติเวช', 'กลุ่มงานนิติเวช'),
        ('กลุ่มงานพยาธิวิทยากายวิภาค', 'กลุ่มงานพยาธิวิทยากายวิภาค'),
        ('กลุ่มงานเภสัชกรรม', 'กลุ่มงานเภสัชกรรม'),
        ('กลุ่มงานโภชนศาสตร์', 'กลุ่มงานโภชนศาสตร์'),
        ('กลุ่มงานรังสีวิทยา', 'กลุ่มงานรังสีวิทยา'),
        ('กลุ่มงานวิสัญญีวิทยา', 'กลุ่มงานวิสัญญีวิทยา'),
        ('กลุ่มงานเวชกรรมฟื้นฟู', 'กลุ่มงานเวชกรรมฟื้นฟู'),
        ('กลุ่มงานเวชศาสตร์ฉุกเฉิน', 'กลุ่มงานเวชศาสตร์ฉุกเฉิน'),
        ('กลุ่มงานศัลยกรรม', 'กลุ่มงานศัลยกรรม'),
        ('กลุ่มงานศัลยกรรมออร์โธปิดิกส์', 'กลุ่มงานศัลยกรรมออร์โธปิดิกส์'),
        ('กลุ่มงานสังคมสงเคราะห์', 'กลุ่มงานสังคมสงเคราะห์'),
        ('กลุ่มงานสูติ-นรีเวชกรรม', 'กลุ่มงานสูติ-นรีเวชกรรม'),
        ('กลุ่มงานโสต ศอ นาสิก', 'กลุ่มงานโสต ศอ นาสิก'),
        ('กลุ่มงานอาชีวเวชกรรม', 'กลุ่มงานอาชีวเวชกรรม'),
        ('กลุ่มงานอายุรกรรม', 'กลุ่มงานอายุรกรรม'),
        ('องค์กรแพทย์', 'องค์กรแพทย์'),
        ('กลุ่มงานการพยาบาลชุมชน', 'กลุ่มงานการพยาบาลชุมชน'),
        ('กลุ่มงานการแพทย์แผนไทยและการแพทย์ทางเลือก', 'กลุ่มงานการแพทย์แผนไทยและการแพทย์ทางเลือก'),
        ('กลุ่มงานเวชกรรมสังคม', 'กลุ่มงานเวชกรรมสังคม'),
        ('กลุ่มงานสุขศึกษา', 'กลุ่มงานสุขศึกษา'),
        ('ฝังเข็ม', 'ฝังเข็ม'),
        ('ศูนย์การเรียนรู้และสร้างเสริมสุขภาพ', 'ศูนย์การเรียนรู้และสร้างเสริมสุขภาพ'),
        ('ศูนย์แพทยศาสตรศึกษาชั้นคลินิก', 'ศูนย์แพทยศาสตรศึกษาชั้นคลินิก'),
        # งานสนับสนุน
        ('งานจัดเก็บรายได้', 'งานจัดเก็บรายได้'),
        ('กลุ่มงานประกันสุขภาพ', 'กลุ่มงานประกันสุขภาพ'),
        ('งานผลิตและพัฒนาบุคลากร', 'งานผลิตและพัฒนาบุคลากร'),
        ('งานเวชนิทัศน์และโสตทัศนศึกษา', 'งานเวชนิทัศน์และโสตทัศนศึกษา'),
        ('งานห้องสมุด', 'งานห้องสมุด'),
        ('กลุ่มงานพัฒนาคุณภาพบริการและมาตรฐาน', 'กลุ่มงานพัฒนาคุณภาพบริการและมาตรฐาน'),
        ('กลุ่มงานยุทธศาสตร์และแผนงานโครงการ', 'กลุ่มงานยุทธศาสตร์และแผนงานโครงการ'),
        ('ศูนย์รับข้อเสนอแนะหลักประกันสุขภาพ', 'ศูนย์รับข้อเสนอแนะหลักประกันสุขภาพ'),
        ('งานเวชสถิติ', 'งานเวชสถิติ'),
        ('ศูนย์คอมพิวเตอร์', 'ศูนย์คอมพิวเตอร์'),
        ('กลุ่มงานผู้ป่วยนอก', 'กลุ่มงานผู้ป่วยนอก'),
        ('แพทย์เพิ่มพูนทักษะ', 'แพทย์เพิ่มพูนทักษะ'),
        ('งานการแพทย์แผนไทยและการแพทย์ทางเลือก', 'งานการแพทย์แผนไทยและการแพทย์ทางเลือก'),
        # งานเภสัชกรรม (ย่อย)
        ('งานบริการเภสัชกรรมผู้ป่วยนอก', 'งานบริการเภสัชกรรมผู้ป่วยนอก'),
        ('งานบริการเภสัชกรรมผู้ป่วยใน', 'งานบริการเภสัชกรรมผู้ป่วยใน'),
        ('งานเภสัชสนเทศและงานคุณภาพ', 'งานเภสัชสนเทศและงานคุณภาพ'),
        ('งานคลังเวชภัณฑ์', 'งานคลังเวชภัณฑ์'),
        ('งานจัดซื้อยาและเวชภัณฑ์', 'งานจัดซื้อยาและเวชภัณฑ์'),
        ('งานเภสัชกรรมการผลิต', 'งานเภสัชกรรมการผลิต'),
        ('งานเภสัชกรรมปฐมภูมิ', 'งานเภสัชกรรมปฐมภูมิ'),
        ('งานบริบาลเภสัชกรรม', 'งานบริบาลเภสัชกรรม'),
        ('งานธุรการเภสัชกรรมและสนับสนุนบริการ', 'งานธุรการเภสัชกรรมและสนับสนุนบริการ'),
        # งานเทคนิคการแพทย์ (ย่อย)
        ('งานห้องปฏิบัติการผู้ป่วยนอก', 'งานห้องปฏิบัติการผู้ป่วยนอก'),
        ('งานอณูชีววิทยา', 'งานอณูชีววิทยา'),
        ('งานห้องปฏิบัติการกลาง', 'งานห้องปฏิบัติการกลาง'),
        ('งานจุลชีววิทยาคลินิก', 'งานจุลชีววิทยาคลินิก'),
        ('งานธนาคารเลือด', 'งานธนาคารเลือด'),
        # งานจิตเวช (ย่อย)
        ('งานสุขภาพจิต', 'งานสุขภาพจิต'),
        ('งานยาเสพติด', 'งานยาเสพติด'),
        # งานเวชกรรมฟื้นฟู (ย่อย)
        ('งานตรวจวินิจฉัย', 'งานตรวจวินิจฉัย'),
        ('งานกายภาพบำบัด', 'งานกายภาพบำบัด'),
        ('งานกิจกรรมบำบัด', 'งานกิจกรรมบำบัด'),
        ('งานกายอุปกรณ์', 'งานกายอุปกรณ์'),
        # งานเวชระเบียน / วิจัย
        ('งานเวชสถิติและเวชระเบียน', 'งานเวชสถิติและเวชระเบียน'),
        ('กลุ่มงานวิจัยและพัฒนาการพยาบาล', 'กลุ่มงานวิจัยและพัฒนาการพยาบาล'),
        ('งานเวชระเบียน', 'งานเวชระเบียน'),
        ('งานติดตามอาการไม่พึงประสงค์จากการใช้ยา', 'งานติดตามอาการไม่พึงประสงค์จากการใช้ยา'),
        # อื่น ๆ
        ('งานการพยาบาลห้องผ่าตัด Excellent', 'งานการพยาบาลห้องผ่าตัด Excellent'),
        ('งานการพยาบาลฉุกเฉิน (EMS)', 'งานการพยาบาลฉุกเฉิน (EMS)'),
        ('ห้องประกันสังคม', 'ห้องประกันสังคม'),
        ('ศูนย์ปรึกษาปัญหาสุขภาพ', 'ศูนย์ปรึกษาปัญหาสุขภาพ'),
        ('งานการพยาบาลวิสัญญี Excellent', 'งานการพยาบาลวิสัญญี Excellent'),
        ('กลุ่มงานการพยาบาลจิตเวช', 'กลุ่มงานการพยาบาลจิตเวช'),
    ]

    id = models.BigAutoField(primary_key=True)

    doc_no = models.CharField(
        max_length=50,
        unique=True
    )

    date = models.DateField()
    from_org = models.CharField(max_length=255, blank=True)
    to_org = models.CharField(max_length=255, blank=True)
    officer = models.CharField(max_length=100, blank=True)
    sender = models.CharField(max_length=255, blank=True)  # ผู้ส่ง
    is_accepted = models.BooleanField(default=False)  # สถานะตอบรับ
    subject = models.CharField(max_length=255)
    department = models.CharField(
        max_length=100,
        choices=DEPARTMENT_CHOICES,
    )
    doc_type = models.CharField(max_length=10, choices=TYPE_CHOICES, default='internal')
    secret_level = models.CharField(max_length=12, choices=SECRET_CHOICES, default='normal')
    urgency = models.CharField(max_length=12, choices=URGENCY_CHOICES, default='normal')
    remark = models.TextField(blank=True)
    file = models.FileField(upload_to='uploads/', validators=[FileExtensionValidator(['pdf'])], blank=False, null=True)

    # เพิ่มเพื่อ workflow
    status = models.CharField(
        max_length=20,
        choices=STATUS_CHOICES,
        default='draft'
    )
    created_by = models.ForeignKey(
        User,
        on_delete=models.SET_NULL,
        null=True,
        blank=True,
        related_name='created_documents'
    )
    created_at = models.DateTimeField(auto_now_add=True)

    def __str__(self):
        return self.subject

class Signature(models.Model):
    document = models.ForeignKey(
        Document,
        on_delete=models.CASCADE,
        related_name='signatures'
    )
    signer = models.ForeignKey(User, on_delete=models.CASCADE)
    signature_image = models.ImageField(upload_to='signatures/')
    signed_at = models.DateTimeField(auto_now_add=True)
    comment = models.TextField(blank=True)
    pos_x = models.FloatField(default=100)
    pos_y = models.FloatField(default=100)
    page_number = models.IntegerField(default=0)

    class Meta:
        unique_together = ['document', 'signer']

    def __str__(self):
        return f'ลายเซ็น {self.signer.username} - {self.document.doc_no}'

class DocumentRoute(models.Model):
    document = models.ForeignKey(Document, on_delete=models.CASCADE)
    department = models.CharField(max_length=100)
    received = models.BooleanField(default=False)
    received_at = models.DateTimeField(null=True, blank=True)

    def __str__(self):
        return f'{self.document.doc_no} → {self.department}'

class Notification(models.Model):
    user = models.ForeignKey(User, on_delete=models.CASCADE)
    message = models.CharField(max_length=255)
    is_read = models.BooleanField(default=False)
    created_at = models.DateTimeField(auto_now_add=True)

    def __str__(self):
        return self.message

class Department(models.Model):
    name = models.CharField(max_length=100)

    def __str__(self):
        return self.name

class DocumentFlow(models.Model):
    document = models.ForeignKey(
        Document,
        on_delete=models.CASCADE,
        related_name='flows'
    )

    from_department = models.CharField(
        max_length=100,
        blank=True
    )
    to_department = models.CharField(
        max_length=100
    )

    sent_by = models.ForeignKey(
        User,
        on_delete=models.SET_NULL,
        null=True
    )

    comment = models.TextField(blank=True)
    sent_at = models.DateTimeField(auto_now_add=True)

    def __str__(self):
        return f"{self.document.doc_no} → {self.to_department}"
  
class Profile(models.Model):

    ROLE_CHOICES = [
        ('admin', 'ผู้ดูแลระบบ'),
        ('staff', 'เจ้าหน้าที่'),
        ('director', 'ผู้อำนวยการ'),
    ]

    user = models.OneToOneField(User, on_delete=models.CASCADE)

    department = models.ForeignKey(
        Department,
        on_delete=models.SET_NULL,
        null=True,
        blank=True
    )

    role = models.CharField(
        max_length=20,
        choices=ROLE_CHOICES,
        default='staff',
        verbose_name='บทบาท'
    )

    def __str__(self):
        return f'{self.user.username} ({self.get_role_display()})'
    
@receiver(post_save, sender=User)
def create_user_profile(sender, instance, created, **kwargs):
    if created:
        Profile.objects.create(user=instance)


@receiver(post_save, sender=User)
def save_user_profile(sender, instance, **kwargs):
    if hasattr(instance, 'profile'):
        instance.profile.save()